#List of 2000 economics related words 
#Ranked by frequency of occurrence in the imf finance and development magazine
#https://www.imf.org/external/pubs/ft/fandd/
#Words with Spanish cognates removed
currency
poverty
spending
inequality
banking
macroeconomic
deficit
wage
unemployment
commodity
output
framework
financing
euro
policymakers
strengthen
governance
regulatory
employment
globalization
liberalization
enterprise
moreover
inflow
liquidity
expenditure
lending
equity
further
donor
boost
indicator
tariff
enhance
trading
instance
wealth
volatility
boom
creditor
remittance
imbalance
transparency
constraint
arrangement
surplus
sustainable
scheme
borrow
liability
vulnerability
ownership
supervision
emission
vulnerable
burden
caput
uncertainty
channel
default
systemic
portfolio
aggregate
borrowing
technological
demographic
foster
regulator
borrower
multilateral
adverse
fell
privatization
developed
restructuring
spillover
sharply
mainly
openness
yield
supervisory
chart
input
digital
favor
longer
recipient
china
earnings
scope
abroad
exporter
nominal
migrant
derivative
allocation
slowdown
competitiveness
surge
imply
supervisor
undertake
worldwide
decrease
costly
weakness
offset
trigger
developing
retirement
comprehensive
surveillance
lend
hedge
consolidation
sustainability
undermine
faster
downturn
mortgage
arise
underlying
leverage
sustained
fertility
heavily
volatile
forecast
analyze
trillion
accounting
whereas
gross
partly
accountability
integrated
widespread
stabilization
bilateral
liberalize
highlight
accelerate
thereby
unlikely
taxation
fluctuation
tackle
elsewhere
skilled
mitigate
favorable
availability
zero
broadly
stimulus
hazard
peak
instability
lender
roughly
ease
depreciation
minimize
delay
prudential
outflow
latter
robust
workforce
conditionality
stabilize
collateral
diaspora
hence
provider
assumption
inadequate
forthcoming
spur
mortality
allocate
improved
weaken
budgetary
underlie
partnership
accumulation
strongly
discourage
sudden
quota
convergence
furthermore
reliance
earlier
entry
insight
fixed
risky
distortion
credibility
evolve
exacerbate
treasury
monitoring
ongoing
pricing
linkage
constrain
elderly
bias
nevertheless
delivery
capita
sizable
persistent
shrink
globally
debtor
contagion
unemployed
buyer
tight
bust
cyclical
widen
overcome
enforce
crop
bubble
reversal
holding
smooth
enforcement
taxpayer
newly
timely
devaluation
diversify
inefficient
mobility
unsustainable
bankruptcy
characterize
stem
norm
shortage
unlike
unprecedented
disruption
turmoil
retail
buffer
shareholder
quantitative
desirable
renminbi
advocate
oversight
repay
innovative
benchmark
membership
supplier
threshold
related
complexity
determinant
anchor
entrepreneur
deepen
intermediation
subprime
fossil
worsen
redistribution
resilience
internationally
restructure
inclusive
likelihood
profile
policymaking
diversification
banknote
urbanization
intraregional
broaden
accession
greatly
involvement
custom
database
tighten
resort
credible
disparity
coefficient
erode
steady
safeguard
monopoly
buildup
diminish
methodology
correlation
swing
compliance
detailed
dollarization
arrears
maximize
making
inflationary
deteriorate
swap
entail
mature
disclosure
subnational
deterioration
successfully
round
expertise
downward
vital
multinational
expectancy
windfall
cope
reliable
nonetheless
depth
repayment
comprise
speculative
optimal
insufficient
felt
enrollment
steadily
analytical
prevail
ambitious
utility
elite
intermediary
emergence
distress
securitization
remarkable
poorly
exit
harm
uncertain
macroeconomics
translate
curb
online
incur
reap
contraction
underpin
contingent
median
prior
offshore
properly
wealthy
soundness
interbank
nongovernmental
precrisis
viable
differential
counterpart
versus
surprisingly
entrepreneurship
chapter
spell
historically
functioning
scarce
awareness
shortfall
rebalancing
wider
outlay
mobilize
coal
mismatch
subsidize
acceleration
protectionist
regression
postwar
mitigation
doesn
privatize
textile
coin
surprising
outlook
spectrum
intensify
nonbank
stakeholder
outstanding
globe
embrace
depositor
stake
profitability
website
pollution
denominate
protectionism
sharing
forum
unequal
progressive
http
hamper
aftermath
mining
bind
counter
accountable
disproportionately
profitable
diversity
parity
municipal
underscore
expected
gauge
solvency
stance
guidance
originate
capability
behavioral
seller
nonperforming
laundering
momentum
corrupt
concessional
outbreak
mixed
prolonged
guideline
specialize
optimistic
timing
strain
merger
upward
unskilled
reporting
disrupt
enhanced
feasible
reward
telecommunication
legitimate
africa
robot
solar
renewable
curve
wisdom
geographic
subsidiary
importer
bulk
countercyclical
loser
shortcoming
willingness
wholesale
prediction
issuance
cotton
council
unexpected
align
rebound
working
accurate
orderly
dependency
regardless
reluctant
warming
renew
striking
correlate
issuer
crunch
macroprudential
adequacy
systemically
equitable
withdraw
sanitation
turbulence
cooperative
systematically
harmful
crash
holder
drain
closer
autonomy
preferential
infant
seize
weigh
narrative
markedly
predictable
boundary
shed
externality
lasting
microeconomic
domestically
impediment
inefficiency
cushion
manufactured
tightening
baseline
didn
ceiling
epidemic
severity
dampen
award
measurement
haven
exemption
poorer
denomination
bargaining
complementary
embark
compound
maintenance
triple
vested
pledge
reformer
restrictive
hinder
attain
rail
promising
solely
dioxide
warrant
bolster
unconventional
helpful
accrue
classify
varies
albeit
receipt
decentralization
decentralize
freely
curtail
compromise
insolvency
venture
explicitly
mount
overseas
asia
onset
disinflation
odious
tranche
uneven
harness
diversified
overly
taking
alleviate
interdependence
depreciate
deem
indebted
span
deflation
aging
avert
convertibility
aspiration
empower
vaccine
disbursement
oversee
crude
depress
advisor
elimination
securitized
divert
emigration
pervasive
india
patent
outline
unclear
microfinance
affordable
merit
rescue
soar
devise
quantify
alike
meaningful
procurement
consolidate
contributor
badly
schooling
nonfinancial
tailor
understood
sectoral
amplify
evasion
virtue
asymmetric
resilient
prone
econometric
painful
flaw
redistributive
pioneer
reconstruction
extraction
precautionary
encouraging
nontariff
voluntary
rigorous
rationale
ruble
ensue
levy
specialization
discretionary
encompass
targeted
drought
acute
payoff
upgrade
facto
beneficiary
entrepreneurial
ineffective
austerity
disposable
redistribute
unpredictable
deviation
harmonize
summit
eligible
outweigh
diffusion
mainstream
conditional
municipality
seemingly
attainment
array
deter
proxy
avoidance
incomplete
predictability
foreigner
caution
bottleneck
insulate
nutrition
engagement
perceived
trader
bail
conversely
straightforward
basket
formulation
sterling
deregulation
simulation
anticorruption
displace
extensively
fare
expansionary
trafficking
dominance
happiness
assert
materialize
endowment
statistically
stagnation
maternal
specialized
supervise
sluggish
excessively
saver
marketplace
deficiency
toll
disruptive
underestimate
indebtedness
flood
tradable
creativity
halt
plausible
optimism
distributional
capitalization
heighten
appoint
licensing
strengthening
streamline
malaria
herd
franc
repression
unstable
puzzle
proliferation
literacy
hunger
playing
decisive
counterparty
automation
brazil
enact
compelling
simplify
auction
insider
plague
exceptional
magnify
needed
constituency
deepening
earner
leveraged
hyperinflation
supportive
entrant
underground
greater
dual
pegged
periphery
removal
motivation
readily
headline
mandatory
unintended
persistence
benign
textbook
intensive
durable
surpass
update
spill
substitution
postcrisis
eventual
exert
aggravate
deleveraging
replacement
easing
bureaucracy
precondition
downside
appropriately
logic
underdeveloped
macro
responsive
envisage
devastate
resume
affiliate
metric
imperfect
abrupt
cease
rebuild
rethink
plunge
rigidity
neglect
unpublished
transnational
greenhouse
inherently
harmonization
accurately
scrutiny
legitimacy
simultaneous
micro
coastal
attributable
procyclical
projected
stifle
dissemination
cumulative
dilemma
conducive
reduces
entitlement
bailouts
catastrophic
coauthor
overnight
restraint
jointly
coordinated
pave
cautious
behave
stagnate
backlash
erupt
vicious
undoubtedly
prevalent
revive
viability
hike
trajectory
tertiary
higher
retreat
sophistication
feedback
likewise
withdrawal
counterparties
prominence
unchanged
troubled
overlap
crypto
polarization
fairness
disclose
steep
widening
japan
conglomerate
erosion
arguably
endorse
manat
pandemic
variability
turnover
tangible
monthly
bound
proponent
incumbent
overhang
participatory
centrally
slump
repercussion
disseminate
bureaucratic
unusually
organizational
contingency
stagnant
adversely
deplete
summarize
completion
generational
mobilization
jeopardize
pyramid
millennials
unfair
pipeline
prevalence
performer
funded
predominantly
bold
imperative
consolidated
challenging
failed
exclusion
illicit
liquidation
citizenship
longevity
amid
copper
sensible
nonresident
clearing
impetus
spark
compel
creditworthiness
clause
pursuit
russia
pharmaceutical
remarkably
standardized
preventive
alongside
retiree
certainty
tide
geopolitical
destabilize
peso
asymmetry
strive
modernize
premise
susceptible
comply
administer
spawn
sovereignty
prerequisite
slum
destabilizing
notwithstanding
divergence
reallocation
implicitly
downgrade
deploy
originator
industrialized
daunt
concession
stride
disburse
ranking
dislocation
smoker
biofuels
electronics
endure
consistency
overhaul
precipitate
megacities
ledger
millennium
managerial
isolate
contend
enrol
paul
hurdle
isolation
societal
liquidate
innovate
breakthrough
spike
chronic
converge
problematic
causality
plummet
barter
intergovernmental
stall
dismantle
regain
implies
excise
blockchain
antidumping
shield
dismal
stark
halve
orient
interwar
emerging
opaque
binding
paradigm
critically
speculation
formerly
damaging
complementarity
hiring
outward
pessimistic
emigrant
realization
boomer
outright
predecessor
inward
outset
elasticity
distressed
rein
differs
workplace
template
diverge
sequencing
industrialization
persistently
fragility
livelihood
fragmentation
manageable
interconnectedness
coming
suitable
outsider
insurer
digit
thrive
spiral
humanitarian
macroeconomist
voucher
voting
cocoa
diversion
disappointing
overwhelm
misalignment
malnutrition
reallocate
expanded
pressing
earthquake
premature
hidden
lessen
accordingly
mega
grapple
capitalize
outsource
nonprofit
counteract
rightly
turnaround
philosopher
unfold
collectively
dynamism
aversion
keynes
laureate
flourish
vigorous
receivables
jobless
revival
secular
behalf
exempt
weakening
dispersion
vibrant
robert
intent
modernization
stabilizer
accuracy
inject
insolvent
refine
authoritarian
sachs
curse
multiplier
hawala
illiquid
globalized
capitalist
john
abolish
empirically
academia
grid
merchandise
antibiotic
causal
restrain
proposition
exhaust
thereafter
disincentive
david
drawback
prolong
backdrop
prevailing
inconsistent
withstand
grows
starting
attendance
injection
desired
refinance
shale
insure
collaborate
bitcoin
postconflict
declaration
theorist
tender
incremental
hybrid
adherence
degradation
corrective
undergraduate
exogenous
forecasting
individually
interestingly
qualitative
midst
unrelated
becomes
bribe
farming
embody
accumulated
fulfill
worrisome
rupee
automate
twentieth
skepticism
lever
luxury
eligibility
microcredit
unleash
sooner
upturn
circumvent
specification
railway
setback
constructive
token
prescribe
grouping
aggressively
scarcity
philanthropy
impair
skeptical
tuberculosis
explanatory
stringent
harvest
tightly
sterilize
overstate
virtuous
overvaluation
geographical
arbitrage
mexico
imposition
allowance
catalyst
sheer
reluctance
substantive
undertaken
nonexistent
renewables
insecurity
perverse
payroll
bloc
rodrik
bout
democratization
unregulated
cartel
judiciary
forge
cohort
unlock
whereby
accordance
versa
staple
inappropriate
transitional
traded
narrowly
footing
prosperous
recapitalization
wheat
deutsche
debut
undesirable
grasp
industrialize
immune
modeling
swiftly
irrational
reshape
elusive
innovator
dictate
embed
multinationals
theoretically
advocacy
nonpoor
steam
interplay
evenly
autonomous
nontraded
emigrate
breakdown
socioeconomic
fintech
disturbance
budgeting
devalue
quarterly
breach
southeastern
foremost
hinge
subsidized
tilt
collateralized
foreseeable
loom
unrealistic
syrup
unwilling
smartphones
strand
pragmatic
replicate
regulated
smoking
europe
added
tends
radically
protracted
maple
myriad
eradicate
notional
conceptual
nontradable
urgently
tier
emanate
generalized
procyclicality
authorize
safer
inconsistency
cohesion
michael
richer
dire
unilateral
unduly
surcharge
distortionary
reschedule
attendant
interim
recurrent
applicable
interconnected
teller
convincing
vastly
repo
autocracy
deforestation
breakup
unfavorable
layoff
enormously
measurable
communism
tech
robustness
solvent
depletion
responsiveness
entrench
bargain
affluent
seeker
negligible
abruptly
fiat
centralized
contractual
harder
selling
fragmented
nascent
reorient
restructurings
revamp
econometrics
mile
qualification
meltdown
utilization
uncover
irrelevant
stiglitz
continental
interdependent
internally
ethic
overview
forgo
misuse
intergenerational
attractiveness
maneuver
bypass
lobbying
recourse
commensurate
concerted
intertemporal
catalyze
overwhelmingly
merge
disappoint
manipulation
soften
justification
progressively
theft
unrest
exceptionally
reorganization
advisory
expatriate
buoyant
kilometer
outperform
closing
residual
dweller
bankrupt
populous
conduit
blog
multidimensional
experimentation
outpace
famously
disposal
tenure
chile
unfortunate
critique
broader
proximity
fulfil
centralize
tame
legislator
targeting
downstream
reassure
prominently
seigniorage
pensioner
absorption
lengthen
aspire
vacuum
sole
hindsight
irrigation
generalize
fallout
demise
proactive
localization
articulate
spurt
disperse
influx
penalize
prop
physic
interconnection
defer
unavoidable
synchronize
disorderly
elevate
admittedly
antipoverty
consecutive
standardize
devastating
provisioning
supranational
preferable
regressive
forefront
inflict
selective
hopeful
pitfall
nonresource
seminal
escalate
contractionary
microeconomics
foresee
dissipate
designate
simpler
wasteful
biodiversity
akin
obsolete
unlimited
tolerance
quadruple
unified
nontraditional
abatement
takeover
imperfection
engender
neoclassical
populist
comparatively
connectivity
groundwork
underline
disproportionate
geographically
alleviation
elicit
remains
peter
solow
commercially
forestall
fertilizer
steer
empowerment
bailout
diagnostic
unwinding
spotlight
drastically
wasn
bhagwati
desirability
friction
stint
globalizers
worthwhile
counterproductive
obesity
dictator
blunt
lease
redefine
namely
upside
paradox
unsecured
endemic
moderation
worse
subsistence
expropriation
gamble
productively
blueprint
chaebol
bribery
prioritize
unification
usher
inertia
adhere
negatively
deliberation
applicant
extraordinarily
outdated
doctorate
recapitalize
financier
universally
pooling
agreed
driven
relocate
slack
download
garment
synergy
informality
undernourishment
appropriation
nigeria
focused
cumbersome
reveals
upstream
convertible
inflate
nineteenth
contentious
enhancement
propel
philanthropist
overarch
dent
richest
camdessus
ameliorate
unproductive
methodological
correspondingly
repurchase
bleak
accentuate
tandem
booming
nationwide
understate
swift
circulate
culminate
decisively
cultivate
earmark
contradictory
refrain
preclude
jargon
disconnect
korea
immunization
hydrocarbon
detrimental
shipment
breed
tiger
reestablish
redress
retrenchment
cheaply
relies
nuanced
overtake
discriminatory
noteworthy
scrutinize
milestone
portend
captive
thinker
anecdotal
lure
wholly
deeper
inequity
precarious
optimize
suppress
soybean
hedging
fore
nonpayment
reconcile
lucrative
burgeon
emit
endow
nontransparent
spent
interconnect
fiscally
antiretroviral
launder
tighter
rationalize
deprive
differentiation
intended
irreversible
provocative
smoothly
brunt
vocational
ration
scar
diagnostics
facet
policymaker
authorization
buying
hover
evade
assertion
james
inflows
overvalue
questionable
blur
generator
necessitate
bureaucrat
outstrip
derail
usefulness
upswing
offshoring
retrain
subjective
pinpoint
cement
wouldn
upheaval
backstop
william
forecaster
overestimate
closure
penetration
opacity
neoliberal
trough
structured
resurgence
occupational
bondholder
entrenched
nurture
email
anticipated
turbulent
thorough
repatriate
predatory
formalize
cybersecurity
cyclically
posit
stubbornly
indefinitely
motif
noncommunicable
revisit
parlance
agrarian
overheat
outreach
unify
rebalance
equalize
endeavor
keen
constituent
transitory
poland
lifelong
assurance
overdue
disregard
randomly
decentralized
insofar
rigorously
specter
insignificant
recur
undercut
upgrading
imprudent
lagging
dairy
reassess
hypothetical
equitably
mislead
multiyear
sticky
robotics
remainder
krugman
unsuccessful
kimchi
doctoral
niche
panacea
incipient
divergent
informative
hectare
inclusiveness
complacency
marketable
wary
discrepancy
mismanagement
taylor
dictatorship
landlocked
were
directive
lengthy
temper
printing
outcomes
unprofitable
absorptive
weaker
broadening
accrual
environmentally
venue
cryptocurrencies
internalize
termite
vaccination
redesign
dubious
strikingly
nonbanks
cyber
undermines
headwind
poise
bidding
disparate
worsening
autocratic
enshrine
unrestricted
shiller
trivial
amend
privatized
discriminate
speculator
germany
uniformly
causation
snapshot
dedollarization
systemwide
indonesia
combustion
progressivity
hasten
unresolved
instill
nuance
unhedged
breadth
propensity
convincingly
cornerstone
decile
informational
crucially
foreclosure
theorem
yearly
federalism
rollover
reliant
static
decouple
depository
australia
daunting
deflator
persuasive
secrecy
garner
deflate
meant
traction
paramount
homegrown
onward
royalty
illuminate
flexibly
indexation
recurrence
postulate
facilitation
disagreement
engulf
profligacy
blanchard
purchasing
generic
impaired
hollow
expenditures
skew
analytics
analogous
rainfall
weighted
founding
footwear
takeoff
internationalization
divest
charles
untapped
charitable
fascinate
vigorously
compulsory
enclave
henry
shorten
prosecute
digitalization
convene
perpetuate
displaced
distorted
redirect
sterilization
drastic
multilateralism
forgone
monopolistic
creep
plug
wallet
ethanol
underpinnings
propagate
dwarf
mint
advent
inventor
stipulate
instal
accelerated
sukuk
overshoot
composite
prosper
listing
protract
falter
favorably
evoke
inaction
unpaid
failing
enlarge
barro
illiquidity
chosen
disentangle
doom
haircut
predictor
jure
loophole
reproductive
disadvantaged
intensely
incompatible
reside
activism
understandable
decoupling
trafficker
reinvigorate
tradables
rajan
ignite
credential
oligarch
emulate
culprit
couldn
unmet
backward
tentative
mindset
interregional
riskiness
ramification
simulate
martin
fourfold
setter
holistic
delve
hardship
backup
mainland
displacement
disastrous
onshore
conundrum
distrust
advancement
anticompetitive
marginally
unpopular
inadequacy
hydropower
unaffected
scant
argentina
mindful
greenspan
vest
adjustable
intuitive
standpoint
deceleration
apparel
probe
rebate
credibly
deregulate
unanticipated
logistics
readable
globalize
optimum
